https://www.w3schools.com/sql/trysql.asp?filename=trysql_select_all
https://www.w3schools.com/sql/sql_where.asp

In [ ]:
SELECT * FROM Customers;

In [ ]:
SELECT customername, city, CustomerID FROM Customers

# Search By Value (cell value must be equal )

In [ ]:
SELECT customername, city, CustomerID FROM Customers
WHERE
city ='London'

In [ ]:
SELECT customername, city, CustomerID FROM Customers
WHERE
city ='London' OR city = 'Bern'

In [ ]:
SELECT customername, city, CustomerID FROM Customers
WHERE
city IN ('London',"Bern")

# Search By contents

In [ ]:
SELECT * FROM Customers
WHERE
city like 'L%'

In [ ]:
SELECT * FROM Customers
WHERE
city like '%n'

In [ ]:
SELECT * FROM Customers
WHERE
city Like '%he%'

In [ ]:
SELECT * FROM Customers
WHERE
city LIKE '_e%'

In [ ]:
SELECT * FROM Customers
WHERE
city LIKE '%E__'

In [ ]:
SELECT * FROM Customers
WHERE ContactName LIKE 'a%o'

# Distinct = Unique

In [ ]:
SELECT distinct(city) FROM Customers

# BETWEEN

In [ ]:
SELECT * FROM Customers
WHERE
customerid BETWEEN 7 AND 20

# NOT

In [ ]:
SELECT * FROM Customers
WHERE
city <> "London"

In [ ]:
SELECT * FROM Customers
WHERE
city != "London"

In [ ]:
SELECT * FROM Customers
WHERE
NOT city = "London"

In [ ]:
SELECT * FROM Customers
WHERE NOT Country='Germany' AND NOT Country='USA';

# ORDER BY

In [ ]:
SELECT * FROM Customers
ORDER BY customerid desc;

In [ ]:
SELECT * FROM Customers
ORDER BY country ASC, customerid DESC;

# CREATE TABLE

In [ ]:
-- create a table
CREATE TABLE students (
  sid INTEGER PRIMARY KEY,
  name TEXT NOT NULL,
  gender TEXT NOT NULL
);

# INSER QUERY

In [ ]:
INSERT INTO students VALUES (1, 'Ryan', 'M');
INSERT INTO students VALUES (2, 'Joanna', 'F');

In [1]:
sid = 1
name = "Asif Khan"
gender = "M"

# Validate all above variables before passing into insert query

query = """
INSERT INTO students VALUES ({}, {}, {});
""".format(sid,name,gender)

print(query)

INSERT INTO students VALUES (1, Asif Khan, M);

### INSERT   INTO

In [ ]:
INSERT INTO students (name,gender) VALUES ('Qasim','M');

## Task

In [ ]:
BEGIN TRANSACTION;

/* Create a table called NAMES */
CREATE TABLE NAMES(Id integer PRIMARY KEY, 
                    Name text,
                    date date,
                    tid INT);

/* Create few records in this table */
INSERT INTO NAMES VALUES(1,'Tom', '2020-04-12', 1 );
INSERT INTO NAMES VALUES(2,'Lucy', '2020-05-12', 2);
INSERT INTO NAMES VALUES(3,'Frank', '2020-04-12', 2);
INSERT INTO NAMES VALUES(4,'Jane', '2020-06-12', 1);
INSERT INTO NAMES VALUES(5,'Robert', '2020-09-12', 2);
COMMIT;

/* Display all the records from the table */
SELECT * FROM NAMES;